In [1]:
import pandas as pd
import numpy as np

In [2]:
#分组后给名称加前缀
dict_obj = {'key1' : ['a', 'b', 'a', 'b',
                      'a', 'b', 'a', 'a'],
            'key2' : ['one', 'one', 'two', 'three',
                      'two', 'two', 'one', 'three'],
            'data1': np.random.randint(1, 10, 8),
            'data2': np.random.randint(1, 10, 8)}
df_obj = pd.DataFrame(dict_obj)
print(df_obj)
print('-'*50)

  key1   key2  data1  data2
0    a    one      1      2
1    b    one      5      3
2    a    two      3      4
3    b  three      7      8
4    a    two      5      2
5    b    two      1      4
6    a    one      8      7
7    a  three      2      1
--------------------------------------------------

In [3]:
df_obj.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   key1    8 non-null      object
 1   key2    8 non-null      object
 2   data1   8 non-null      int32
 3   data2   8 non-null      int32
dtypes: int32(2), object(2)
memory usage: 324.0+ bytes

In [4]:
# 按key1分组后，计算data1，data2的统计信息并附加到原始表格中，并添加表头前缀
k1_sum = df_obj.groupby('key1').mean(numeric_only=True).add_prefix('mean_')
print(k1_sum)

      mean_data1  mean_data2
key1
a       3.800000         3.2
b       4.333333         5.0

In [7]:
# 方法2，使用transform，分组后计算结果和原本的df保持一致
k1_sum_tf = df_obj.loc[:,['key1','data1', 'data2']].groupby('key1').transform('mean').add_prefix('mean_')
k1_sum_tf
# df_obj[k1_sum_tf.columns] = k1_sum_tf
# print(df_obj)

   mean_data1  mean_data2
0    3.800000         3.2
1    4.333333         5.0
2    3.800000         3.2
3    4.333333         5.0
4    3.800000         3.2
5    4.333333         5.0
6    3.800000         3.2
7    3.800000         3.2

In [17]:

del df_obj['key2']

In [18]:
df_obj.groupby('key1').transform(np.mean)

C:\Users\XH\AppData\Local\Temp\ipykernel_1112268\2916770615.py:1: FutureWarning: The provided callable <function mean at 0x000001BFFE2858A0> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df_obj.groupby('key1').transform(np.mean)

      data1  data2
0  3.800000    3.2
1  4.333333    5.0
2  3.800000    3.2
3  4.333333    5.0
4  3.800000    3.2
5  4.333333    5.0
6  3.800000    3.2
7  3.800000    3.2

In [19]:
df_obj

  key1  data1  data2
0    a      1      2
1    b      5      3
2    a      3      4
3    b      7      8
4    a      5      2
5    b      1      4
6    a      8      7
7    a      2      1

In [20]:
#实现a组和b组，谁比平均分高，谁比平均分低
def diff_mean(s):
    """
        返回数据与均值的差值，s传入的是某一个分组
    """
    return s - s.mean()

print(df_obj.groupby('key1').transform(diff_mean))

      data1  data2
0 -2.800000   -1.2
1  0.666667   -2.0
2 -0.800000    0.8
3  2.666667    3.0
4  1.200000   -1.2
5 -3.333333   -1.0
6  4.200000    3.8
7 -1.800000   -2.2